Revit 2024 API
MeshTriangle Class
One triangle of a mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class MeshTriangle
Visual Basic
Public Class MeshTriangle
Visual C++
public ref class MeshTriangle
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MeshTriangle
See Also
MeshTriangle Members
Autodesk.Revit.DB Namespace